src/Documents/Поступление/Поступление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Поступление</name>
  <registerRecords>AccumulationRegister.Поставщики</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/Поставщики/Поставщики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Поставщики</name>
  <resources>
    <name>Сумма</name>
    <comment>Сумма в валюте взаиморасчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Поступление/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Поставщики.Записывать = Истина;
	Движение = Движения.Поставщики.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	
	Движение.Период		= Дата;
	Движение.Контрагент	= Контрагент;
	Движение.Сумма		= Сумма;
	Движение.Количество	= Количество;
	
КонецПроцедуры
